In [1]:
import sqlite3
conn = sqlite3.connect(":memory:")
cur = conn.cursor()

In [11]:
cur.executescript("""
DROP TABLE IF EXISTS persons;
CREATE TABLE persons(
    id INT,
    firstname VARCHAR(10),
    surname VARCHAR(10),
    birthday DATE,
    color VARCHAR(10),
    quantity INT);
""").fetchall()

[]

## Insert

In [12]:
cur.execute("""
INSERT INTO
    persons
VALUES
    (1,"Vivian","Hamilton","1971-07-08","green",1);""").fetchall()

cur.execute("SELECT * FROM persons;").fetchall()

[(1, 'Vivian', 'Hamilton', '1971-07-08', 'green', 1)]

In [14]:
cur.execute("""
INSERT INTO 
    persons
VALUES
   (2,"Karen","Holcomb","1974-05-23","green",4),
   (3,"Cody","Garrett","1973-04-22","orange",1); """).fetchall()
cur.execute("SELECT * FROM persons").fetchall()

[(1, 'Vivian', 'Hamilton', '1971-07-08', 'green', 1),
 (2, 'Karen', 'Holcomb', '1974-05-23', 'green', 4),
 (3, 'Cody', 'Garrett', '1973-04-22', 'orange', 1),
 (2, 'Karen', 'Holcomb', '1974-05-23', 'green', 4),
 (3, 'Cody', 'Garrett', '1973-04-22', 'orange', 1)]

In [15]:
## informaci√≥n parcial

cur.execute("""
INSERT INTO
    persons (color, firstname, surname) VALUES
        ("violet","Vivian", "Kinney"),
    ("blue","Hope","Kingston"),
    ("red","Kylan","Bigelow");""").fetchall()

[]

In [16]:
cur.execute("SELECT * FROM persons;").fetchall()

[(1, 'Vivian', 'Hamilton', '1971-07-08', 'green', 1),
 (2, 'Karen', 'Holcomb', '1974-05-23', 'green', 4),
 (3, 'Cody', 'Garrett', '1973-04-22', 'orange', 1),
 (2, 'Karen', 'Holcomb', '1974-05-23', 'green', 4),
 (3, 'Cody', 'Garrett', '1973-04-22', 'orange', 1),
 (None, 'Vivian', 'Kinney', None, 'violet', None),
 (None, 'Hope', 'Kingston', None, 'blue', None),
 (None, 'Kylan', 'Bigelow', None, 'red', None)]

In [17]:
cur.execute("""
INSERT INTO persons (firstname)
VALUES
    ("Camilo");""").fetchall()
cur.execute("SELECT * FROM persons;").fetchall()

[(1, 'Vivian', 'Hamilton', '1971-07-08', 'green', 1),
 (2, 'Karen', 'Holcomb', '1974-05-23', 'green', 4),
 (3, 'Cody', 'Garrett', '1973-04-22', 'orange', 1),
 (2, 'Karen', 'Holcomb', '1974-05-23', 'green', 4),
 (3, 'Cody', 'Garrett', '1973-04-22', 'orange', 1),
 (None, 'Vivian', 'Kinney', None, 'violet', None),
 (None, 'Hope', 'Kingston', None, 'blue', None),
 (None, 'Kylan', 'Bigelow', None, 'red', None),
 (None, 'Camilo', None, None, None, None)]

In [18]:
cur.execute("""
INSERT INTO
    persons
VALUES
    (NULL,"Kate","Bond","1974-05-23",NULL,NULL);
""").fetchall()

cur.execute("SELECT * FROM persons;").fetchall()

[(1, 'Vivian', 'Hamilton', '1971-07-08', 'green', 1),
 (2, 'Karen', 'Holcomb', '1974-05-23', 'green', 4),
 (3, 'Cody', 'Garrett', '1973-04-22', 'orange', 1),
 (2, 'Karen', 'Holcomb', '1974-05-23', 'green', 4),
 (3, 'Cody', 'Garrett', '1973-04-22', 'orange', 1),
 (None, 'Vivian', 'Kinney', None, 'violet', None),
 (None, 'Hope', 'Kingston', None, 'blue', None),
 (None, 'Kylan', 'Bigelow', None, 'red', None),
 (None, 'Camilo', None, None, None, None),
 (None, 'Kate', 'Bond', '1974-05-23', None, None)]

# UPDATE

In [19]:
cur.execute("""
UPDATE persons SET
    id = 8,
    color = 'gray'
WHERE
    firstname = 'Kate';
    """).fetchall()
cur.execute("SELECT * FROM persons;").fetchall()

[(1, 'Vivian', 'Hamilton', '1971-07-08', 'green', 1),
 (2, 'Karen', 'Holcomb', '1974-05-23', 'green', 4),
 (3, 'Cody', 'Garrett', '1973-04-22', 'orange', 1),
 (2, 'Karen', 'Holcomb', '1974-05-23', 'green', 4),
 (3, 'Cody', 'Garrett', '1973-04-22', 'orange', 1),
 (None, 'Vivian', 'Kinney', None, 'violet', None),
 (None, 'Hope', 'Kingston', None, 'blue', None),
 (None, 'Kylan', 'Bigelow', None, 'red', None),
 (None, 'Camilo', None, None, None, None),
 (8, 'Kate', 'Bond', '1974-05-23', 'gray', None)]

In [20]:
## Se actualiza el campo con base en el indicador.

cur.execute("""
UPDATE
    persons
SET
    color ='black'
WHERE
    id = 8;
""").fetchall()

cur.execute("SELECT *  FROM persons;").fetchall()

[(1, 'Vivian', 'Hamilton', '1971-07-08', 'green', 1),
 (2, 'Karen', 'Holcomb', '1974-05-23', 'green', 4),
 (3, 'Cody', 'Garrett', '1973-04-22', 'orange', 1),
 (2, 'Karen', 'Holcomb', '1974-05-23', 'green', 4),
 (3, 'Cody', 'Garrett', '1973-04-22', 'orange', 1),
 (None, 'Vivian', 'Kinney', None, 'violet', None),
 (None, 'Hope', 'Kingston', None, 'blue', None),
 (None, 'Kylan', 'Bigelow', None, 'red', None),
 (None, 'Camilo', None, None, None, None),
 (8, 'Kate', 'Bond', '1974-05-23', 'black', None)]

# DELETE

In [21]:
cur.execute("""
DELETE FROM
    persons
WHERE
    color = 'green';
""").fetchall()

cur.execute("SELECT * FROM persons;").fetchall()

[(3, 'Cody', 'Garrett', '1973-04-22', 'orange', 1),
 (3, 'Cody', 'Garrett', '1973-04-22', 'orange', 1),
 (None, 'Vivian', 'Kinney', None, 'violet', None),
 (None, 'Hope', 'Kingston', None, 'blue', None),
 (None, 'Kylan', 'Bigelow', None, 'red', None),
 (None, 'Camilo', None, None, None, None),
 (8, 'Kate', 'Bond', '1974-05-23', 'black', None)]